"""
Известно, что на доске 8×8 можно расставить 8 ферзей так, чтобы они не били
друг друга. Вам дана расстановка 8 ферзей на доске, определите, есть ли среди
них пара бьющих друг друга.


Формат ввода:
Программа получает на вход восемь пар чисел, каждое число от 1 до 8 -
координаты 8 ферзей.


Формат вывода:
Если ферзи не бьют друг друга, выведите слово NO, иначе выведите YES.


Примеры:
Тест 1
>>> 1 7
>>> 2 4
>>> 3 2
>>> 4 8
>>> 5 6
>>> 6 1
>>> 7 3
>>> 8 5
NO

Тест 2
>>> 1 8
>>> 2 7
>>> 3 6
>>> 4 5
>>> 5 4
>>> 6 3
>>> 7 2
>>> 8 1
YES

Тест 3
>>> 3 4
>>> 8 5
>>> 4 1
>>> 7 3
>>> 6 6
>>> 1 7
>>> 5 8
>>> 2 2
YES
"""


def main():
    xs = []
    ys = []
    difs_xy = []
    sums_xy = []
    for i in range(8):
        x, y = map(int, input().split())
        dif_xy = x - y
        sum_xy = x + y

        xs.append(x)
        ys.append(y)
        difs_xy.append(dif_xy)
        sums_xy.append(sum_xy)

    xs = set(xs)
    ys = set(ys)
    difs_xy = set(difs_xy)
    sums_xy = set(sums_xy)
    if len(xs) == 8 and len(ys) == 8 and \
            len(difs_xy) == 8 and len(sums_xy) == 8:
        print('NO')
    else:
        print('YES')


main()
