"""
Формат ввода:
Вводится целое неотрицательное число N(N≤100).


Формат вывода:
Выведите 2ᴺ.


Примеры:
Тест 1
>>> 2
4
"""

power = int(input())
power_of_two = 2 ** power
print(power_of_two)
